#!/bin/bash
# awk-simple.sh

month_length () # 以月份数作为参数.
{ # 返回这个月有几天.
monthD="31 28 31 30 31 30 31 31 30 31 30 31" # 作为局部变量来声明?
echo "$monthD" | awk '{ print $'"${1}"' }'  # 有技巧的.
#                             ^^^^^^^^^
# 先将参数传递到函数中 ($1 -- 月份号), 然后就到 awk 了.
# Awk 将会根据传递进来的月份号来决定打印"print $1 . . . print $12"中的哪个 
#+(依赖于月份号)
# 传递参数到内嵌 awk 脚本的模版:
#                                   $'"${script_parameter}"'

# 需要错误检查来修正参数的范围(1-12)
#+ 并且要处理闰年的特殊的 2 月.
}

# ----------------------------------------------
# 用例:
month=4         # 拿4月来举个例子. 
days_in=$(month_length $month)
echo $days_in   # 30
# ----------------------------------------------
